import re
from enum import Enum
import pandas as pd
from pydantic import Field, ConfigDict
from moapy.auto_convert import auto_schema, MBaseModel
from moapy.enum_pre import enum_to_list
from moapy.designers_guide.resource.report_form import ReportForm
from moapy.designers_guide.func_general import DG_Result_Reports
from moapy.data_post import print_result_data, ResultMD

class KS18Grades(Enum):
    SS275 = "SS275"
    SM275 = "SM275"
    SM355 = "SM355"
    SHP275 = "SHP275"
    SHP355 = "SHP355"

class HSectionData:
    data = [
            ["H 100x50x5/7", "H", 0.1, 0.05, 0.005, 0.007, 0.001185, 1.8e-06, 1.48e-07, 4.1795e-05],
            ["H 100x100x6/8", "H", 0.1, 0.1, 0.006, 0.008, 0.00219, 3.83e-06, 1.34e-06, 8.4184e-05],
            ["H 125x125x6.5/9", "H", 0.125, 0.125, 0.0065, 0.009, 0.003031, 8.47e-06, 2.93e-06, 0.000149105],
            ["H 150x75x5/7", "H", 0.15, 0.075, 0.005, 0.007, 0.001785, 6.66e-06, 4.95e-07, 9.8195e-05],
            ["H 148x100x6/9", "H", 0.148, 0.1, 0.006, 0.009, 0.002684, 1.02e-05, 1.51e-06, 0.00015045],
            ["H 150x150x7/10", "H", 0.15, 0.15, 0.007, 0.01, 0.004014, 1.64e-05, 5.63e-06, 0.000239575],
            ["H 198x99x4.5/7", "H", 0.198, 0.099, 0.0045, 0.007, 0.002318, 1.58e-05, 1.14e-06, 0.000170451],
            ["H 200x100x5.5/8", "H", 0.2, 0.1, 0.0055, 0.008, 0.002716, 1.84e-05, 1.34e-06, 0.000200152],
            ["H 194x150x6/9", "H", 0.194, 0.15, 0.006, 0.009, 0.003901, 2.69e-05, 5.07e-06, 0.000296214],
            ["H 200x200x8/12", "H", 0.2, 0.2, 0.008, 0.012, 0.006353, 4.72e-05, 1.6e-05, 0.000513152],
            ["H 200x204x12/12", "H", 0.2, 0.204, 0.012, 0.012, 0.007153, 4.98e-05, 1.7e-05, 0.000553152],
            ["H 208x202x10/16", "H", 0.208, 0.202, 0.01, 0.016, 0.008369, 6.53e-05, 2.2e-05, 0.000697984],
            ["H 248x124x5/8", "H", 0.248, 0.124, 0.005, 0.008, 0.003268, 3.54e-05, 2.55e-06, 0.00030536],
            ["H 250x125x6/9", "H", 0.25, 0.125, 0.006, 0.009, 0.003766, 4.05e-05, 2.94e-06, 0.000351861],
            ["H 244x175x7/11", "H", 0.244, 0.175, 0.007, 0.011, 0.005624, 6.12e-05, 9.84e-06, 0.000534772],
            ["H 244x252x11/11", "H", 0.244, 0.252, 0.011, 0.011, 0.008206, 8.79e-05, 2.94e-05, 0.000781407],
            ["H 248x249x8/13", "H", 0.248, 0.249, 0.008, 0.013, 0.00847, 9.93e-05, 3.35e-05, 0.000859263],
            ["H 250x250x9/14", "H", 0.25, 0.25, 0.009, 0.014, 0.009218, 1.08e-04, 3.65e-05, 0.000936889],
            ["H 250x255x14/14", "H", 0.25, 0.255, 0.014, 0.014, 0.01047, 1.15e-04, 3.88e-05, 0.001015014],
            ["H 298x149x5.5/8", "H", 0.298, 0.149, 0.0055, 0.008, 0.00408, 6.32e-05, 4.42e-06, 0.000455026],
            ["H 300x150x6.5/9", "H", 0.3, 0.15, 0.0065, 0.009, 0.004678, 7.21e-05, 5.08e-06, 0.000522077],
            ["H 294x200x8/12", "H", 0.294, 0.2, 0.008, 0.012, 0.007238, 0.000113, 1.6e-05, 0.0008226],
            ["H 298x201x9/14", "H", 0.298, 0.201, 0.009, 0.014, 0.008336, 0.000133, 1.9e-05, 0.000963201],
            ["H 294x302x12/12", "H", 0.294, 0.302, 0.012, 0.012, 0.01077, 0.000169, 5.52e-05, 0.001240668],
            ["H 298x299x9/14", "H", 0.298, 0.299, 0.009, 0.014, 0.01108, 0.000188, 6.24e-05, 0.001352849],
            ["H 300x300x10/15", "H", 0.3, 0.3, 0.01, 0.015, 0.01198, 0.000204, 6.75e-05, 0.00146475],
            ["H 300x305x15/15", "H", 0.3, 0.305, 0.015, 0.015, 0.01348, 0.000215, 7.1e-05, 0.00157725],
            ["H 304x301x11/17", "H", 0.304, 0.301, 0.011, 0.017, 0.01348, 0.000234, 7.73e-05, 0.001669054],
            ["H 310x305x15/20", "H", 0.31, 0.305, 0.015, 0.02, 0.01653, 0.0002815, 9.46e-05, 0.002042375],
            ["H 310x310x20/20", "H", 0.31, 0.31, 0.02, 0.02, 0.01808, 0.0002939, 9.94e-05, 0.0021625],
            ["H 346x174x6/9", "H", 0.346, 0.174, 0.006, 0.009, 0.005268, 0.000111, 7.92e-06, 0.000689118],
            ["H 350x175x7/11", "H", 0.35, 0.175, 0.007, 0.011, 0.006314, 0.000136, 9.84e-06, 0.000840847],
            ["H 354x176x8/13", "H", 0.354, 0.176, 0.008, 0.013, 0.007368, 0.000161, 1.18e-05, 0.000995376],
            ["H 336x249x8/12", "H", 0.336, 0.249, 0.008, 0.012, 0.008815, 0.000185, 3.09e-05, 0.0011628],
            ["H 340x250x9/14", "H", 0.34, 0.25, 0.009, 0.014, 0.01015, 0.000217, 3.65e-05, 0.001360024],
            ["H 338x351x13/13", "H", 0.338, 0.351, 0.013, 0.013, 0.01353, 0.000282, 9.38e-05, 0.001799343],
            ["H 344x348x10/16", "H", 0.344, 0.348, 0.01, 0.016, 0.0146, 0.000333, 0.000112, 0.002069664],
            ["H 344x354x16/16", "H", 0.344, 0.354, 0.016, 0.016, 0.01666, 0.000353, 0.000118, 0.002247168],
            ["H 350x350x12/19", "H", 0.35, 0.35, 0.012, 0.019, 0.01739, 0.000403, 0.000136, 0.002493182],
            ["H 350x357x19/19", "H", 0.35, 0.357, 0.019, 0.019, 0.01914, 0.000428, 0.000144, 0.002707557],
            ["H 396x199x7/11", "H", 0.396, 0.199, 0.007, 0.011, 0.007216, 0.0002, 1.45e-05, 0.001087548],
            ["H 400x200x8/13", "H", 0.4, 0.2, 0.008, 0.013, 0.008412, 0.000237, 1.74e-05, 0.001285952],
            ["H 404x201x9/15", "H", 0.404, 0.201, 0.009, 0.015, 0.009616, 0.000275, 2.03e-05, 0.001487556],
            ["H 386x299x9/14", "H", 0.386, 0.299, 0.009, 0.014, 0.01201, 0.000337, 6.24e-05, 0.001845561],
            ["H 390x300x10/16", "H", 0.39, 0.3, 0.01, 0.016, 0.0136, 0.000387, 7.21e-05, 0.00211561],
            ["H 388x402x15/15", "H", 0.388, 0.402, 0.015, 0.015, 0.01785, 0.00049, 0.000163, 0.002729805],
            ["H 394x398x11/18", "H", 0.394, 0.398, 0.011, 0.018, 0.01868, 0.000561, 0.000189, 0.003046115],
            ["H 394x405x18/18", "H", 0.394, 0.405, 0.018, 0.018, 0.02144, 0.000597, 0.0002, 0.003317778],
            ["H 400x300x39/24", "H", 0.4, 0.3, 0.039, 0.024, 0.02854, 0.000662, 0.00011, 0.003915264],
            ["H 400x400x13/21", "H", 0.4, 0.4, 0.013, 0.021, 0.02187, 0.000666, 0.000224, 0.003600133],
            ["H 400x408x21/21", "H", 0.4, 0.408, 0.021, 0.021, 0.02507, 0.000709, 0.000238, 0.003920133],
            ["H 406x403x16/24", "H", 0.406, 0.403, 0.016, 0.024, 0.02549, 0.00078, 0.000262, 0.00420736],
            ["H 414x405x18/28", "H", 0.414, 0.405, 0.018, 0.028, 0.02954, 0.000928, 0.00031, 0.004953978],
            ["H 428x407x20/35", "H", 0.428, 0.407, 0.02, 0.035, 0.03607, 0.00119, 0.000394, 0.006239105],
            ["H 458x417x30/50", "H", 0.458, 0.417, 0.03, 0.05, 0.05286, 0.001877, 0.000605, 0.00946803],
            ["H 498x432x45/70", "H", 0.498, 0.432, 0.045, 0.07, 0.07701, 0.00298, 0.00094, 0.014384565],
            ["H 446x199x8/12", "H", 0.446, 0.199, 0.008, 0.012, 0.00843, 0.000287, 1.58e-05, 0.00139256],
            ["H 450x200x9/14", "H", 0.45, 0.2, 0.009, 0.014, 0.009676, 0.000335, 1.87e-05, 0.001621489],
            ["H 434x299x10/15", "H", 0.434, 0.299, 0.01, 0.015, 0.0135, 0.000468, 6.69e-05, 0.002287255],
            ["H 440x300x11/18", "H", 0.44, 0.3, 0.011, 0.018, 0.01574, 0.000561, 8.11e-05, 0.002727644],
            ["H 496x199x9/14", "H", 0.496, 0.199, 0.009, 0.014, 0.01013, 0.000419, 1.84e-05, 0.001835656],
            ["H 500x200x10/16", "H", 0.5, 0.2, 0.01, 0.016, 0.01142, 0.000478, 2.14e-05, 0.00209636],
            ["H 506x201x11/19", "H", 0.506, 0.201, 0.011, 0.019, 0.01313, 0.000565, 2.58e-05, 0.002462169],
            ["H 482x300x11/15", "H", 0.482, 0.3, 0.011, 0.015, 0.01455, 0.000604, 6.76e-05, 0.002663336],
            ["H 488x300x11/18", "H", 0.488, 0.3, 0.011, 0.018, 0.01635, 0.00071, 8.11e-05, 0.003099836],
            ["H 596x199x10/15", "H", 0.596, 0.199, 0.01, 0.015, 0.01205, 0.000687, 1.98e-05, 0.002535175],
            ["H 600x200x11/17", "H", 0.6, 0.2, 0.011, 0.017, 0.01344, 0.000776, 2.28e-05, 0.002863179],
            ["H 606x201x12/20", "H", 0.606, 0.201, 0.012, 0.02, 0.01525, 0.000904, 2.72e-05, 0.003316788],
            ["H 612x202x13/23", "H", 0.612, 0.202, 0.013, 0.023, 0.01707, 0.00103, 3.18e-05, 0.003777651],
            ["H 582x300x12/17", "H", 0.582, 0.3, 0.012, 0.017, 0.01745, 0.00103, 7.67e-05, 0.003782412],
            ["H 588x300x12/20", "H", 0.588, 0.3, 0.012, 0.02, 0.01925, 0.00118, 9.02e-05, 0.004308912],
            ["H 594x302x14/23", "H", 0.594, 0.302, 0.014, 0.023, 0.02224, 0.00137, 0.000106, 0.00501723],
            ["H 692x300x13/20", "H", 0.692, 0.3, 0.013, 0.02, 0.02115, 0.00172, 9.02e-05, 0.005413588],
            ["H 700x300x13/24", "H", 0.7, 0.3, 0.013, 0.024, 0.02355, 0.00201, 0.000108, 0.006248788],
            ["H 708x302x15/28", "H", 0.708, 0.302, 0.015, 0.028, 0.02736, 0.00237, 0.000129, 0.00734422],
            ["H 792x300x14/22", "H", 0.792, 0.3, 0.014, 0.022, 0.02434, 0.00254, 9.93e-05, 0.007040264],
            ["H 800x300x14/26", "H", 0.8, 0.3, 0.014, 0.026, 0.02674, 0.00292, 0.000117, 0.007995464],
            ["H 808x302x16/30", "H", 0.808, 0.302, 0.016, 0.03, 0.03076, 0.00339, 0.000138, 0.009286696],
            ["H 890x299x15/23", "H", 0.89, 0.299, 0.015, 0.023, 0.02668, 0.00339, 0.000103, 0.008633619],
            ["H 900x300x16/28", "H", 0.9, 0.3, 0.016, 0.028, 0.03058, 0.00404, 0.000126, 0.010174144],
            ["H 912x302x18/34", "H", 0.912, 0.302, 0.018, 0.034, 0.03601, 0.00491, 0.000157, 0.012220816],
            ["H 918x303x19/37", "H", 0.918, 0.303, 0.019, 0.037, 0.03874, 0.00535, 0.000172, 0.013260487]
        ]
    # Column names
    columns = ["Section", "Shape", "H", "B", "tw", "tf", "Area", "Iy", "Iz", "Zp"]

    @classmethod
    def to_dataframe(cls):
        # Creating the dataframe
        return pd.DataFrame(cls.data, columns=cls.columns)

    @classmethod
    def get_section_enum(cls):
        df = cls.to_dataframe()
        # Define the HSection enum directly using class syntax
        enum_dict = {section: section for section in df['Section']}
        HSection = Enum('HSection', enum_dict)
        return HSection

# 입력구조체
class InputData(MBaseModel):

    Section: str = Field(default="H 100x50x5/7", title="H형강의 단면을 선택하세요", description="형강의 단면 특성을 통해 계산됩니다",
                     enum=enum_to_list(HSectionData.get_section_enum())
                     )
    Grade: str = Field(default="SS275", title="강종을 선택하세요", description="항복강도를 기준으로 계산됩니다",
                     enum=enum_to_list(KS18Grades)
                     )

    model_config = ConfigDict(
        title="Soilworks LEM Pile Nail 구조특성 입력도구",
        # description="SoilWorks LEM Pile/Nail input Parameter Calculator "
    )

# 섹션 속성 및 강종의 항복강도와 인장강도를 계산하는 함수
@auto_schema(title="Soilworks LEM Pile Nail 구조특성 입력도구", description="LEM 해석에서 말뚝이나 네일을 활용할 경우 특성을 참고하여 계산 및 입력할 수 있습니다. 특히 Nail/Pile 저항 메커니즘 선택 시 선택한 단면과 강종에 따른 소성모멘트와 휨강성 계산결과를 제공합니다.")
def calculate_properties(inp: InputData) -> DG_Result_Reports:

    # 탄성계수 (E_steel) 설정 (예: 200 GPa = 200,000,000 kN/m²)
    E_steel = 200000000

    # 강종의 항복강도와 인장강도 계산
    match = re.search(r'\d+', inp.Grade)
    fy_value = int(match.group()) * 1000
    if fy_value == 275000:
        tensile_strength = 410000
    elif fy_value == 355000:
        tensile_strength = 490000
    else:
        tensile_strength = None

    # 데이터 프레임 만들기
    df = HSectionData().to_dataframe()

    # 섹션 속성 계산
    filtered_df = df[df['Section'] == inp.Section]
    if filtered_df.empty:
        raise ValueError(f"섹션 '{inp.Section}'에 해당하는 데이터가 없습니다.")

    iy_value = filtered_df['Iy'].values[0]
    zp_value = filtered_df['Zp'].values[0]
    area_value = filtered_df['Area'].values[0]

    plastic_moment = fy_value * zp_value
    flexural_rigidity = E_steel * iy_value
    tension_force = 0.6 * tensile_strength * area_value

    # 마크다운 형태로 변환
    md_result = f"""
<style>
    body {{
        font-family: 'Arial', sans-serif;
        line-height: 1.6;
        background-color: #f9f9f9;
        color: #333;
        padding: 20px;
        font-size: 16px; /* 본문 글자 크기 */
    }}
    h1, h2, h3 {{
        color: #2c3e50;
    }}
    table {{
        border-collapse: collapse;
        width: 60%; /* 표의 너비를 60%로 조정 */
        margin: 10px auto; /* 표를 가운데 정렬 */
        font-size: 14px; /* 표 전체 글자 크기 */
    }}
    table, th, td {{
        border: 1px solid #ddd;
        padding: 8px;
    }}
    th {{
        background-color: #f4f4f4;
        font-size: 15px; /* 헤더 글자 크기 */
    }}
    td {{
        font-size: 13px; /* 본문 셀 글자 크기 */
    }}
    th, td {{
        text-align: left;
    }}
</style>


# SoilWorks LEM Pile/Nail 구조특성 계산 리포트

## Overview  
> 본 리포트는 LEM해석에서 말뚝이나 네일 부재에 대한 참고사항을 포함하고있습니다. 특히 Nail/Pile 저항 메커니즘 선택 시 선택한 단면과 강종에 따른 소성모멘트와 휨강성 계산결과를 제공합니다.  
> 본 내용은 SoilWorks Analysis Reference 에 기재되어 있는 내용을 바탕으로 제작 되었습니다.
---

### 일반
| 속성                              | 값       | 단위 |
|-----------------------------------|----------|------|
| **보강재간격**                     | -        | m    |
| **초기확산 폭**                     | -        | m    |
| **초기확산 각**                     | -       | [deg] |
| **안전율로 보강력 보정**             | Independent / Dependent | -    |

> * *보강재 간격 : 보강재의 종방향 간격을 입력합니다.  
> * *보강재 폭 : 초기확산폭 / 확산각 : LEM 해석에서 보강재 삽입시에는 diffusion 영역에 해당하는 slice에 대해서 일정부분의 강도 증가를 고려해주어야 하는데, 이때 diffusion 영역을 결정짓는 입력값이 바로 초기 확산 폭과 초기확산 각입니다. Diffusion 영역은 아래의 그림과 같이 보강재와 수직인 방향으로 초기확산 폭 만큼의 영역을 설정하고, 초기확산 폭에서 초기확산 각만큼 벌어진 선을 그어 파괴 원호와 만나는 점을 찾아 diffusion 영역(아래 그림의 빗금친 영역)을 결정해 줍니다. 초기확산 각을 너무 작게 설정하는 경우에는 diffusion 영역에 대한 강도 증가가 안전율에 주는 영향이 거의 없게 됩니다. 때문에 초기확산 폭은 일반적으로 지압판의 크기에 해당하는 1.0m 또는 2.0m를 사용하고, 초기확산 각은 일반적으로 10~20도의 값을 사용합니다.  
> * *안전율로 보강력 보정 : 절편력 반복계산 시 보강력을 각 단계의 안전율로 보정(안전율로 나눔) 할지 여부를 결정합니다.  
> Independent (보정안함) : 입력된 보강력을 절편력 반복계산에 그대로 적용합니다. 비탈면의 활동력감소와 저항력 증진 목적의 거동에 적합합니다.  
> Dependent (보정) : 절편력 반복계산시 한 스텝에서 결정된 안전율로 다음 스텝의 보강력을 안전율 로 나누어 보강력을 계속 보정해 가며 절편의 평형력을 계산합니다. 활동력 감소보다는 변형 발생 이후 시점부터 저항력을 증진시키는 거동에 적합니다.    
---

### 보강력
| 속성                              | 값       | 단위 |
|-----------------------------------|----------|------|
| **인장력**                        | 150      | kN   |
| **인장/전단 적용방법**              | Nail/Pile | -    |
| **최소적용길이**                   | 0        | m    |
| **qs로부터 인발력 계산**            | -        | -    |
| **등가반경**                      | 1        | m    |

> * *인장력 : 인장력은 보강재의 한계인장력을 의미합니다. 일반 쏘일네일 설계시에는 대부분 허용인장강도를 사용하여 인장강도의 절반만을 사용하고 있으며, 이는 불확실성이 내재되어 있는 네일에 대한 보정치로 0.5 정도를 주고 있습니다. (ex) SD40 : 4000kg/cm^2 X 0.5 X 0.0008m^2=400000kN/m^2 X 0.5 X 0.0008m^2 =160kN/EA)  
> * *인장/전단 적용방식 : Nail, Pile, Nail/Pile로 정의할 수 있습니다.  
> Nail : 인장력(입력)과 인발력(qs로부터 계산 또는 입력) 중 작은 값이 축방향 보강력으로 적용되고, 값 또는 함수로 입력한 전단력이 적용됩니다. 일반적으로 Nail을 모사할 때 사용합니다.  
> Pile : 소성모멘트와 휨강성에 의해 계산된 전단력이 적용됩니다. 인장력은 전단력의 상한(Tresca 기준 상 전단력은 인장력의 50%를 넘을 수 없음)으로만 사용되고 축방향 보강력으로는 적용되지 않습니다. 일반적으로 Pile을 모사할 때 사용합니다. T_axial=2T_shear, (R_axial/2)^2 + R_shear^2 ≤ T_shear^2  
> Nail/Pile  : 임계각(θcr)에 의해 전단지배(Pile), 인장지배(Nail), 인장+전단(Nail/Pile)을 판단하여 보강력을 계산합니다. 
---

### 선택한 단면과 강종에 따른 추가 속성 
| 속성                              | 값       | 단위     |
|-----------------------------------|----------|----------|
| **선택된 단면**                | {inp.Section:<8}     |  -       |
| **선택된 재질 등급**           | {inp.Grade:<8}       |  -       |
| **소성모멘트**                       | {plastic_moment:<8} | kN·m²   |
| **휨강성**                        | {flexural_rigidity:<8} | kN·m²   |
| **임계각**                        | -        | [deg]   |
| **탄성계수 (E)**                  | {E_steel:<8}          | kN/m²    |
| **소성 단면 계수 (Zp)**           | {zp_value:<8}         | m³       |
| **단면 2차 모멘트 (Iy)**          | {iy_value:<8}         | m⁴       |
| **인장 강도**                     | {tensile_strength:<8} | kPa      |
| **항복 강도 (fy)**                | {fy_value:<8}         | MPa      |

> * *전단력 : 일반적으로 전단시험을 통해서 구할 수 있으며 직접전단시험(direct shear box test)와 연직/경사 네일에 대한 현장시험 등을 토대로 실행된 실험적 연구를 바탕으로 산정하실 수 있습니다.  
(Juran et al, 1981, Marchal, 1984; Plumelle, 1989; Delage et al., 1989) 
> * *말뚝휨강성 : EI값으로 (말뚝의 탄성계수) x (말뚝 2차 단면모멘트)로 입력하실 수 있습니다.  
> * *소성모멘트 : (말뚝의 항복응력) x (소성단면계수)로 입력하실 수 있습니다.
> * *소성단면계수 : 중립축 상/하부분의 각 단면적의 중립축에 대한 단면 1차모멘트의 합을 의미합니다. 
> * *임계각 : 보강력을 계산할 때, 전단지배(Pile), 인장지배(Nail), 인장+전단(Nail/Pile)을 구분하기 위한 임계각(θcr)을 입력합니다. 파괴원호의 접선과 보강재가 이루는 각(θ)가 π/2-θcr보다 크면 전단지배, θcr보다 작으면 인장지배, θcr보다 크고 π/2-θcr보다 작으면 인장+전단으로 적용합니다. 삽입한 보강재가 전단지배인지 인장지배인지 동시 고려되는지 사용자가 규정하지 않고, 보강재가 박힌 각도에 따라 지배되는 계산 방식을 달리할 때 사용합니다. 임계각은 5도 이하로 적용하는 것이 일반적입니다. 

    """

    return ResultMD(md=md_result)

if __name__ == "__main__":

    res = calculate_properties(InputData())
    print(res)


    # res = calculate_properties(**{"inp":{"Section":"H 918x303x19/37","Grade":"SS275"}})
    # print_result_data(res)


    res = calculate_properties(**{"inp":{"Section":"H 918x303x19/37","Grade":"SS275"}})
    result_md = print_result_data(res)

    # # 마크다운 결과를 파일로 저장
    # with open("soilworks_result.md", "w", encoding="utf-8") as f:
    #     f.write(result_md)
